app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    # byebug
    @student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "new1first"], ["last_name", "new1last"], ["created_at", "2020-05-19 20:36:04.017471"], ["updated_at", "2020-05-19 20:36:04.017471"]]
---
  def create
    # byebug
    @student = Student.new
    @student.first_name = params[:student][:first_name]
    @student.last_name = params[:student][:last_name]
    @student.save